Simulation/01_CFD/rtvcCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
(
	forceCoeffs
	{
		type forceCoeffs;
		functionObjectLibs ("libforces.so");
		patches (base bodytube noseconeBase noseconeTip); //change to your patch name
		pName p;
		uName U;
		rhoName rhoInf;
		rhoInf 1.225;
		CofR (0 0 0);
		liftDir (0 1 0);
		dragDir (0 0 -1);
		pitchAxis (1 0 0);
		magUInf 15;
		lRef 0.067;
		Aref 0.0036317;
	}
);
// ************************************************************************* //
