Simulation/01_CFD/rtvcCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 1.307336 -14.9429); //5deg aoa

boundaryField
{
    farField
    {
        type            freestream;
        freestreamValue uniform (0 1.307336 -14.9429); //5deg aoa
    }

    nosecone
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bodytube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    base
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
