Simulation/01_CFD/rtvcCase/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    farField
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }

    nosecone
    {
        type            fixedValue;
        value           uniform 0;
    }
    base
    {
        type            fixedValue;
        value           uniform 0;
    }

    bodytube
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //
